loadtest.yaml
config:
  target: "http://localhost:80" 
  phases:
    - duration: 20 
      arrivalRate: 5 
  engines:
    socketio-v3: {}

scenarios:
  - name: "Classroom rapid typing simulation"
    engine: socketio-v3
    flow:
      - connect:
          transports: ["websocket"]
          extraHeaders:
            Origin: "http://localhost:5173" 
      - emit:
          channel: "join-session"
          data: 
            - "load-test-room"
            - { "username": "VirtualStudent", "role": "Student" }
      - think: 1
      - loop:
          - emit:
              channel: "broadcast-execution"
              data:
                sessionId: "load-test-room"
                output: "[VirtualStudent Broadcast]:\nExecution successful (Artillery Test)"
          - think: 0.5 
        count: 10